#pragma once

// Pubg Mobile Battelgrounds (3.0.0 -- 64Bit) SDK Generate By @hhamk2
// Telegram Channel:- @SANSERO_MOD_1
// Generate on Mon Jan  8 10:14:12 2024
 
namespace SDK
{
//---------------------❣︎➪𝐒𝐀𝐍𝐒𝐄𝐑𝐎 𝐃𝐄𝐕𝐄𝐋𝐎𝐏𝐄𝐑༆✈︎🇪🇬---------------------------
//Classes
//---------------------❣︎➪𝐒𝐀𝐍𝐒𝐄𝐑𝐎 𝐃𝐄𝐕𝐄𝐋𝐎𝐏𝐄𝐑༆✈︎🇪🇬---------------------------

// Class AI.AESpawner
// 0x0048 (0x05A8 - 0x0560)
class AAESpawner : public ASTSpawnerBase
{
public:
	struct FScriptMulticastDelegate                    OnUnitTakeDamage;                                         // 0x0560(0x0010) (ZeroConstructor, InstancedReference)
	unsigned char                                      bEnableTeamAI : 1;                                        // 0x0570(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0571(0x0007) MISSED OFFSET
	TArray<class UClass*>                              TeamAIClasses;                                            // 0x0578(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                SpawnerTeamID;                                            // 0x0588(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TEnumAsByte<EBotCategray>                          SpeciesCategory;                                          // 0x058C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x058D(0x0003) MISSED OFFSET
	int                                                SpawnerCampItemID;                                        // 0x0590(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GroupID;                                                  // 0x0594(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<class UActorComponent*>                     TeamAIComponents;                                         // 0x0598(0x0010) (ExportObject, ZeroConstructor)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AESpawner");
		return pStaticClass;
	}


	void SwitchTeamAI(bool bEnable);
	void OnUnitTakeDamageEvent(float Damage, const struct FDamageEvent& DamageEvent, class AActor* Victim, class AActor* Causer);
	void OnUnitSpawned(class AActor* NewUnit, const struct FSTSpawnParam& SpawnParam, class ASTSpawnerBase* Spawner);
	void OnSpawnTimingRipe(bool IsRipe);
	void OnOwnedMobDead(class ASTExtraSimpleCharacter* DeadCharacter, class AController* Killer, class AActor* DamageCauser, const struct FHitResult& KillingHitInfo, const struct FVector& KillingHitImpulseDir, class UClass* KillingHitDamageType);
	void OnOwnedFakePlayerDead(class ASTExtraBaseCharacter* DeadCharacter, class AController* Killer, class AActor* DamageCauser, const struct FHitResult& KillingHitInfo, const struct FVector& KillingHitImpulseDir, class UClass* KillingHitDamageType);
	TEnumAsByte<EBotCategray> GetSpeciesCategory();
	float GetSpawnerTeamID();
	float GetSpawnerGroupID();
	int GenerateParamID(int ConfigId, int BaseParamID, const struct FSTSpawnParam& SpawnParam);
	void DeactivateSpawner();
	void BPOnUnitSpawned(class APawn* AIPawn, int ConfigId, const struct FSTSpawnParam& SpawnParam);
	void ActivateSpawner();
};


// Class AI.AESpawnSubsystem
// 0x01E0 (0x03A0 - 0x01C0)
class UAESpawnSubsystem : public USTSpawnSubsystem
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x01C0(0x0008) MISSED OFFSET
	unsigned char                                      bPopQueAfterCustomPreCheckFailed : 1;                     // 0x01C8(0x0001)
	unsigned char                                      UnknownData01[0x7];                                       // 0x01C9(0x0007) MISSED OFFSET
	struct FMonsterParams                              CacheMobParams;                                           // 0x01D0(0x0060)
	struct FFakePlayerParams                           CacheFPParams;                                            // 0x0230(0x0010)
	struct FAIPlayerParams                             CacheAIPParams;                                           // 0x0240(0x000C)
	struct FVehicleParams                              CacheVehicleParams;                                       // 0x024C(0x0014)
	TMap<TEnumAsByte<EBotCategray>, int>               UnitsNumberThreshold;                                     // 0x0260(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData02[0xF0];                                      // 0x02B0(0x00F0) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AESpawnSubsystem");
		return pStaticClass;
	}


	class AActor* SpawnUnit(const struct FSTSpawnParam& SpawnParam);
	void RegisterSpawner(class ASTSpawnerBase* Spawner);
	bool PreCheck();
	void ModifyThreshold(TEnumAsByte<EBotCategray> Category, int Threshold);
	int GetUnitsNumByCategory(TEnumAsByte<EBotCategray> Category);
	int GetUnitConfigID(class AActor* Unit);
	TArray<class ASTSpawnerBase*> GetGroupedSpawners(int InGroupID);
	void EnQueue(class ASTSpawnerBase* Spawner, struct FSTSpawnParam* SpawnParam);
	void CleanQueue();
	bool CheckCategoryLimit(class ASTSpawnerBase* Spawner, int* AvailableBalance);
};


// Class AI.AIActionExecutionComponent
// 0x0028 (0x0200 - 0x01D8)
class UAIActionExecutionComponent : public ULuaActorComponent
{
public:
	class AController*                                 OwnerController;                                          // 0x01D8(0x0008) (ZeroConstructor, IsPlainOldData)
	class ANewFakePlayerAIController*                  MyAIController;                                           // 0x01E0(0x0008) (ZeroConstructor, IsPlainOldData)
	class ASTExtraPlayerController*                    MyPlayerController;                                       // 0x01E8(0x0008) (ZeroConstructor, IsPlainOldData)
	class ASTExtraBaseCharacter*                       MyPlayerPawn;                                             // 0x01F0(0x0008) (ZeroConstructor, IsPlainOldData)
	class UMLAIControllerComponent*                    MyMLAIControllerComp;                                     // 0x01F8(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIActionExecutionComponent");
		return pStaticClass;
	}


	void UseItem(int ItemId, int WeaponSlot);
	void SwapAttachmentItem(int ItemId, int SourceWeaponSlot, int TargetWeaponSlot);
	void SetGrenadeLastSelectID(int WeaponId);
	void SetFocusRotation(float InPitch, float InYaw, float InRoll);
	void SetCurShootingPose();
	void RescueTarget(class ASTExtraBaseCharacter* RescueCharacter);
	void OpenDoor();
	void OnFakePlayerRespawn();
	bool IsValid();
	bool IsFreeCamera();
	class APickUpWrapperActor* GetPickActorWithID(int UID);
	class ASTExtraBaseCharacter* GetOwnerBaseCharacter();
	class UBackpackComponent* GetBackpackComponent();
	void DropItem(int ItemId, int Count);
	void DoActionMove(bool IsRun, float DirectionX, float DirectionY, float DirectionZ);
	void DoActionFreeCamera(bool IsEnter, float InPitch, float InYaw, float InRoll);
	void DisuseItem(int ItemId, int WeaponSlot);
	void CloseDoor();
};


// Class AI.AIBasicStateInfoComponent
// 0x0000 (0x01D8 - 0x01D8)
class UAIBasicStateInfoComponent : public ULuaActorComponent
{
public:

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIBasicStateInfoComponent");
		return pStaticClass;
	}


	void OnItemStateChanged(const struct FVector& Location);
	struct FTLogAIShootInfo GetTLogAIShootInfo();
	class APickUpWrapperActor* GetPickActorWithID(int UID);
};


// Class AI.AIBehaviorAdapter_VehicleBase
// 0x0148 (0x0320 - 0x01D8)
class UAIBehaviorAdapter_VehicleBase : public UVehicleComponent
{
public:
	float                                              QueryEnemyRange;                                          // 0x01D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              QueryEnemyAngle;                                          // 0x01DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MinTimeLockTarget;                                        // 0x01E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              MaxRememberEnemySeconds;                                  // 0x01E4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              PreciseHatredDecreaseSpeed;                               // 0x01E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bCorrectAfterTurnOver : 1;                                // 0x01EC(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x01ED(0x0003) MISSED OFFSET
	float                                              CorrectAfterTurnOverCD;                                   // 0x01F0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x01F4(0x0004) MISSED OFFSET
	TArray<struct FBehaviorRegion>                     BehaviorRegions;                                          // 0x01F8(0x0010) (Edit, ZeroConstructor)
	float                                              FollowSegmentTolerance;                                   // 0x0208(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x020C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 CurveThrottleInput;                                       // 0x0210(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinAngleWhenPivotSteering;                                // 0x0218(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x021C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 CurveThrottleRateWhenTurning;                             // 0x0220(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 CurveSteeringInput;                                       // 0x0228(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bUseBrakeWhenTurning;                                     // 0x0230(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x0231(0x0003) MISSED OFFSET
	float                                              MinRequiredSteeringChange;                                // 0x0234(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinLengthRateAlmostReach;                                 // 0x0238(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x023C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 CurveBrakeAlmostReach;                                    // 0x0240(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SteeringThresholdUseBrake;                                // 0x0248(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SpeedThresholdUseBrake;                                   // 0x024C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bBlockTest : 1;                                           // 0x0250(0x0001) (Edit, BlueprintVisible)
	unsigned char                                      UnknownData06[0x3];                                       // 0x0251(0x0003) MISSED OFFSET
	float                                              BlockTestingTime;                                         // 0x0254(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              BlockSpeedThresholdKMH;                                   // 0x0258(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x025C(0x0004) MISSED OFFSET
	class UClass*                                      DeadInventoryBoxTemplate;                                 // 0x0260(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                DropID;                                                   // 0x0268(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x4];                                       // 0x026C(0x0004) MISSED OFFSET
	struct FName                                       WrapperBoxName;                                           // 0x0270(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class APlayerTombBox*                              DeadTombBox;                                              // 0x0278(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bDebug;                                                   // 0x0280(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData09[0x3];                                       // 0x0281(0x0003) MISSED OFFSET
	int                                                DebugLevel;                                               // 0x0284(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              DebugInterval;                                            // 0x0288(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData10[0x4];                                       // 0x028C(0x0004) MISSED OFFSET
	struct FString                                     BehaviorServiceDebugInfo;                                 // 0x0290(0x0010) (BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData11[0x50];                                      // 0x02A0(0x0050) MISSED OFFSET
	class ASTExtraVehicleBase*                         OwnerVehicle;                                             // 0x02F0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      bCacheMeshOnHit : 1;                                      // 0x02F8(0x0001)
	unsigned char                                      UnknownData12[0x27];                                      // 0x02F9(0x0027) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIBehaviorAdapter_VehicleBase");
		return pStaticClass;
	}


	void Suicide();
	void RPC_Client_SetServiceDebugInfo(const struct FString& Info);
	void OnInit();
	void OnDeath(class AController* InstigatedBy);
	float LuaCalculateHitRate(float Distance, float BaseHitRate);
	bool IsInBehaviorRegion(const struct FVector& InLocation);
	bool IsAlive();
	void HandleOnVehicleUnderAttack(class AController* EventInstigator, const struct FDamageEvent& DamageEvent, class AActor* DamageCauser, float Damage);
	void HandleOnVehicleHealthStateChanged(ESTExtraVehicleHealthState InVehicleHealthState);
	void HandleOnMeshHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BroadcastServiceDebugInfo();
	void BPReceiveDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser, TEnumAsByte<EDamageType> DamageEventType);
};


// Class AI.AIBehaviorAdapter_Tank
// 0x00F8 (0x0418 - 0x0320)
class UAIBehaviorAdapter_Tank : public UAIBehaviorAdapter_VehicleBase
{
public:
	class UCurveFloat*                                 AimDurationCurve;                                         // 0x0320(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   AimDurationDeviation;                                     // 0x0328(0x0008) (Edit, IsPlainOldData)
	float                                              ShootTurretCD;                                            // 0x0330(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BulletExplosionRange;                                     // 0x0334(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AimingLockRange;                                          // 0x0338(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              AimingLockRangeWhenFiring;                                // 0x033C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   TurretAimRange;                                           // 0x0340(0x0008) (Edit, BlueprintVisible, IsPlainOldData)
	unsigned char                                      bPredictEnemyMove : 1;                                    // 0x0348(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0349(0x0003) MISSED OFFSET
	struct FVector2D                                   TurretShootRange;                                         // 0x034C(0x0008) (Edit, IsPlainOldData)
	unsigned char                                      bAimingConstantLerp : 1;                                  // 0x0354(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0355(0x0003) MISSED OFFSET
	float                                              TurretAimingInterpConstantSpeed;                          // 0x0358(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TurretAimingInterpSpeed;                                  // 0x035C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              SimTurretAimingInterpConstantSpeed;                       // 0x0360(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              TurretAimingErrorTolerance;                               // 0x0364(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bAlsoCheckArcLength : 1;                                  // 0x0368(0x0001) (Edit)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0369(0x0003) MISSED OFFSET
	float                                              ShootTargetLocationOffset;                                // 0x036C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bTraceBlockShootTargetLocation : 1;                       // 0x0370(0x0001) (Edit)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0371(0x0003) MISSED OFFSET
	int                                                MaxTraceBlockTryTimes;                                    // 0x0374(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      bResetTurretAfterDestroy : 1;                             // 0x0378(0x0001) (Edit)
	unsigned char                                      bFailedAimingWhenTurretCollided : 1;                      // 0x0378(0x0001) (Edit)
	unsigned char                                      UnknownData04[0x7];                                       // 0x0379(0x0007) MISSED OFFSET
	TMap<float, float>                                 BaseHitRate;                                              // 0x0380(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              ShootMGCD;                                                // 0x03D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ShootMGDuration;                                          // 0x03D4(0x0008) (Edit, IsPlainOldData)
	float                                              ShootMGInterval;                                          // 0x03DC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   ShootUpDownRange;                                         // 0x03E0(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   ShootLeftRightRange;                                      // 0x03E8(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   ShootLeftRightRangeDistance;                              // 0x03F0(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   ShootTargetSpeedRange;                                    // 0x03F8(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   ShootTargetDistanceRangeDueToSpeed;                       // 0x0400(0x0008) (Edit, IsPlainOldData)
	struct FVector2D                                   MGShootRange;                                             // 0x0408(0x0008) (Edit, IsPlainOldData)
	unsigned char                                      bShouldMissOnPurpose : 1;                                 // 0x0410(0x0001)
	unsigned char                                      bCacheUsingMG : 1;                                        // 0x0410(0x0001)
	unsigned char                                      bCacheUsingTurret : 1;                                    // 0x0410(0x0001)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0411(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIBehaviorAdapter_Tank");
		return pStaticClass;
	}


	bool UpdateTurretAimingTarget(const struct FVector& TargetLocation, float DeltaSeconds, bool FailedWhenCollided);
	bool ShootTurret();
	bool ShootMachineGun();
	void OnInit();
	void OnDeath(class AController* InstigatedBy);
	bool IsTurretLockTarget(const struct FVector& TargetLocation, float LockRadius);
	bool IsAlive();
	void HandleOnVehicleHealthStateChanged(ESTExtraVehicleHealthState InVehicleHealthState);
	void BroadcastTankShootWeapon(bool IsTurret);
};


// Class AI.AIPerceptionDynamicItemComponent
// 0x0020 (0x01F8 - 0x01D8)
class UAIPerceptionDynamicItemComponent : public ULuaActorComponent
{
public:
	TArray<struct FChildDynamicItem>                   ChildArray;                                               // 0x01D8(0x0010) (Edit, ZeroConstructor)
	struct FScriptDelegate                             GetDynamicItemDurabilityDelegate;                         // 0x01E8(0x0010) (Edit, ZeroConstructor, InstancedReference)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIPerceptionDynamicItemComponent");
		return pStaticClass;
	}

};


// Class AI.AISoundCollectionComponent
// 0x0180 (0x0358 - 0x01D8)
class UAISoundCollectionComponent : public ULuaActorComponent
{
public:
	TMap<uint32_t, struct FCacheSoundState>            CacheStepSounds;                                          // 0x01D8(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FCacheSoundState>            CacheWeaponSounds;                                        // 0x0228(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FCacheSoundState>            CacheVehicleSounds;                                       // 0x0278(0x0050) (ZeroConstructor)
	TMap<uint32_t, struct FCacheSoundState>            CacheGrenadeSounds;                                       // 0x02C8(0x0050) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0318(0x0018) MISSED OFFSET
	float                                              ClearStepSoundTime;                                       // 0x0330(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ClearWeaponSoundTime;                                     // 0x0334(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ClearVehicleSoundTime;                                    // 0x0338(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ClearGrenadeSoundTime;                                    // 0x033C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                StepSoundMaxNum;                                          // 0x0340(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                WeaponSoundMaxNum;                                        // 0x0344(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VehicleSoundMaxNum;                                       // 0x0348(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                GrenadeSoundMaxNum;                                       // 0x034C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class AController*                                 OwnerController;                                          // 0x0350(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AISoundCollectionComponent");
		return pStaticClass;
	}


	void OnCollectionHearSound(ESoundType soundType, const struct FVector& InPos, class AActor* InSourceActor);
	void OnAISoundManagerHear(class AActor* InTargetActor, ESoundType soundType, const struct FVector& InPos, class AActor* InSourceActor);
	TArray<struct FSoundState> GetCollectSoundInfo();
};


// Class AI.AIStateInfoComponent
// 0x0FC0 (0x1198 - 0x01D8)
class UAIStateInfoComponent : public UAIBasicStateInfoComponent
{
public:
	TMap<int, int>                                     ProgressSkillConfig;                                      // 0x01D8(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<int, bool>                                    AvailableBackpacItemTypes;                                // 0x0228(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<int, int>                                     GrenadeTypeConfig;                                        // 0x0278(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              VisibleAngle;                                             // 0x02C8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     HeadOffset;                                               // 0x02CC(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              NearByEnemyRange;                                         // 0x02D8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	float                                              FogWeatherRangeScale;                                     // 0x02DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	int                                                NearByEnemyMaxNum;                                        // 0x02E0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsSearchNearItem;                                         // 0x02E4(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x02E5(0x0003) MISSED OFFSET
	int                                                NearbyItemMaxNum;                                         // 0x02E8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxBoxNum;                                          // 0x02EC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyAirDropBoxRangeInner;                               // 0x02F0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyAirDropBoxRangeOuter;                               // 0x02F4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyDeathBoxRange;                                      // 0x02F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyPickUpWrapperRange;                                 // 0x02FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CacheNearbyItemRangeCoefficient;                          // 0x0300(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxTreasureChestNum;                                // 0x0304(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyTreasureChestRange;                                 // 0x0308(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxWeedNum;                                         // 0x030C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyWeedRange;                                          // 0x0310(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyFindBuildingRange;                                  // 0x0314(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ItemStateChangedRange;                                    // 0x0318(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsItemVisiable;                                           // 0x031C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsUseItemSpotLoc;                                         // 0x031D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x031E(0x0002) MISSED OFFSET
	float                                              NearbyObstacleRange;                                      // 0x0320(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyThrownRange;                                        // 0x0324(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbySmokeRange;                                         // 0x0328(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyThrownMaxNum;                                       // 0x032C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0330(0x0004) MISSED OFFSET
	int                                                NearbyDoorMaxNum;                                         // 0x0334(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyVehicleRange;                                       // 0x0338(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	int                                                NearbyVehicleMaxNum;                                      // 0x033C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyBulletHoleRange;                                    // 0x0340(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyBulletHoleMaxNum;                                   // 0x0344(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyDynamicItemsRange;                                  // 0x0348(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyDynamicItemsMaxNum;                                 // 0x034C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyMonsterRange;                                       // 0x0350(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMonsterMaxNum;                                      // 0x0354(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAIStateInfo                                CacheAIStateInfo;                                         // 0x0358(0x0720)
	struct FDiffAIStateInfo                            CacheDiffAIStateInfo;                                     // 0x0A78(0x05A8)
	bool                                               IsTouchedPlayer;                                          // 0x1020(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreTreeAIWhenNoPlayerAround;                          // 0x1021(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x2];                                       // 0x1022(0x0002) MISSED OFFSET
	float                                              IgnoreTreeAIRadius;                                       // 0x1024(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	uint32_t                                           FrameNo;                                                  // 0x1028(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               UseBodyTPPCamera;                                         // 0x102C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x102D(0x0003) MISSED OFFSET
	TArray<int>                                        IgnoredMonsterIDs;                                        // 0x1030(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	class ASTExtraPlayerController*                    MyPlayerController;                                       // 0x1040(0x0008) (ZeroConstructor, IsPlainOldData)
	class AController*                                 OwnerController;                                          // 0x1048(0x0008) (ZeroConstructor, IsPlainOldData)
	class ANewFakePlayerAIController*                  MyAIController;                                           // 0x1050(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAIActingComponent*                          AIActingComp;                                             // 0x1058(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class APawn*                                       MyOwnerPawn;                                              // 0x1060(0x0008) (ZeroConstructor, IsPlainOldData)
	class ABattleRoyaleGameModeBase*                   MyGameMode;                                               // 0x1068(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x90];                                      // 0x1070(0x0090) MISSED OFFSET
	TArray<struct FVehicleDamageInfo>                  VehicleDamageInfo;                                        // 0x1100(0x0010) (ZeroConstructor)
	TMap<int, class APickUpWrapperActor*>              CacheAINearByItem;                                        // 0x1110(0x0050) (ZeroConstructor)
	struct FCacheNearbyItemState                       CacheNearbyItemState;                                     // 0x1160(0x0020)
	class UMLAIControllerComponent*                    MyMLAIControllerComp;                                     // 0x1180(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	uint32_t                                           CacheModeMapId;                                           // 0x1188(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0xC];                                       // 0x118C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponent");
		return pStaticClass;
	}


	static void SetIsRequestComprehensiveData(bool InIsRequestComprehensiveData);
	TArray<struct FItemStateData> QueryItemStates(int MaxBoxNum, int MaxItemNum, float AirDropBoxRangeInner, float AirDropBoxRangeOuter, float DeathBoxRange, float PickUpWrapperRange, float FindBuildingRange, bool InIsUseItemSpotLoc, int MaxTreasureChestNum, float TreasureChestRange, int MaxWeedNum, float WeedRange);
	void OnVehicleDamageInfo(class AController* InstigatorController, class AController* VictimController, int DamageTypeId, float Damage, bool bIsFatalHealthCost, class AActor* DamageCauser, class AActor* VictimVehicle);
	void OnFakePlayerRespawn();
	void OnAIStateRequestEnd();
	bool IsValid();
	bool IsAvailableBackpacItemType(const struct FItemDefineID& DefineID);
	bool HasPlayerAround();
	struct FVector GetViewForwardVector(class ACharacter* InCharacter);
	static struct FVehicleState GetVehicleStatus(class ASTExtraVehicleBase* InVehicle, class ASTExtraBaseCharacter* PawnInCar);
	struct FTLogAIShootInfo GetTLogAIShootInfo();
	struct FAIStateInfo GetTeammatePlayerStateInfo(class ASTExtraBaseCharacter* InCharacter, TArray<struct FString> InWhiteList);
	TArray<struct FSoundState> GetSoundInfo();
	struct FProgressBarState GetProgressBarState();
	struct FAIPlayerInteractInfo GetPlayerInteractInfo();
	class ASTExtraBaseCharacter* GetOwnerBaseCharacter();
	TArray<struct FObstacleState> GetObstaclesState(class ASTExtraBaseCharacter* InPawn, float Range);
	TArray<struct FVehicleState> GetNearbyVehicles(class ASTExtraBaseCharacter* InPawn);
	static struct FGlobalGameState GetGlobalGameState(class UWorld* InWorld, bool bUpdateLastCache);
	uint32_t GetFrameNo();
	TArray<struct FDoorState> GetDoorsState(float Range, int MaxNum);
	static struct FDiffGlobalGameStateGeneral GetDiffGlobalGameStateGeneral(class UWorld* InWorld);
	static struct FDiffGlobalGameState GetDiffGlobalGameState(class UWorld* InWorld);
	static struct FDiffAllPlayerInfoGeneral GetDiffAllPlayerStateInfoGeneral(class UWorld* InWorld, bool bNeedDebugInfo);
	static struct FDiffAllPlayerInfo GetDiffAllPlayerStateInfoCCS(class UWorld* InWorld, bool bUseDiff, bool bSeparate);
	struct FDiffAIStateInfoGeneral GetDiffAIStateInfoGeneral();
	struct FDiffAIStateInfo GetDiffAIStateInfo();
	struct FAIDamageSources GetDamageSources();
	struct FCameraState GetCameraState(class ASTExtraBaseCharacter* InCharacter);
	static TArray<struct FAIStateInfo> GetAllPlayerStateInfo(class UWorld* InWorld, bool bNeedUpdateCache);
	struct FAIStateInfo GetAIStateInfoInternal();
	struct FAIStateInfo GetAIStateInfo();
	TArray<struct FAIBackpackItem> GetAIPlayerBackpackItems();
	TArray<struct FAINearbyThrown> GetAINearbyThrownState(class ASTExtraBaseCharacter* InCharacter, float InRange, float InCheckAngle, int MaxNum, float InSmokeRange);
	void ClearVehicleDamageInfo();
	void ClearPlayerInteractInfo();
	void ClearDamageSources();
};


// Class AI.AIStateInfoComponentBase
// 0x1580 (0x1758 - 0x01D8)
class UAIStateInfoComponentBase : public UAIBasicStateInfoComponent
{
public:
	class UAIStateInfoDataAsset*                       AIStateInfoDataAsset;                                     // 0x01D8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FAIStateInfoBaseMod                         CacheAIStateInfoBaseMod;                                  // 0x01E0(0x04D0)
	struct FAIStateInfoBaseMod                         LastAIStateInfoBaseMod;                                   // 0x06B0(0x04D0)
	struct FDiffAIStateInfoBaseModGeneral              CacheDiffAIStateInfoBaseModGeneral;                       // 0x0B80(0x0640)
	struct FDiffAIStateInfoBaseMod                     CacheDiffAIStateInfoBaseMod;                              // 0x11C0(0x0428)
	bool                                               IsTouchedPlayer;                                          // 0x15E8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x15E9(0x0003) MISSED OFFSET
	uint32_t                                           FrameNo;                                                  // 0x15EC(0x0004) (ZeroConstructor, IsPlainOldData)
	class ASTExtraPlayerController*                    MyPlayerController;                                       // 0x15F0(0x0008) (ZeroConstructor, IsPlainOldData)
	class AController*                                 OwnerController;                                          // 0x15F8(0x0008) (ZeroConstructor, IsPlainOldData)
	class ANewFakePlayerAIController*                  MyAIController;                                           // 0x1600(0x0008) (ZeroConstructor, IsPlainOldData)
	class UAIActingComponent*                          AIActingComp;                                             // 0x1608(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class APawn*                                       MyOwnerPawn;                                              // 0x1610(0x0008) (ZeroConstructor, IsPlainOldData)
	class ABattleRoyaleGameModeBase*                   MyGameMode;                                               // 0x1618(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x90];                                      // 0x1620(0x0090) MISSED OFFSET
	TArray<struct FVehicleDamageInfo>                  VehicleDamageInfo;                                        // 0x16B0(0x0010) (ZeroConstructor)
	TMap<int, class APickUpWrapperActor*>              CacheAINearByItem;                                        // 0x16C0(0x0050) (ZeroConstructor)
	TArray<class ASTExtraBaseCharacter*>               CacheNearbyEnemies;                                       // 0x1710(0x0010) (ZeroConstructor)
	struct FCacheNearbyItemState                       CacheNearbyItemState;                                     // 0x1720(0x0020)
	class UMLAIControllerComponent*                    MyMLAIControllerComp;                                     // 0x1740(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	uint32_t                                           CacheModeMapId;                                           // 0x1748(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x174C(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponentBase");
		return pStaticClass;
	}


	static void SetIsRequestComprehensiveData(bool InIsRequestComprehensiveData);
	TArray<struct FItemStateData> QueryItemStates(int MaxBoxNum, int MaxItemNum, float AirDropBoxRangeInner, float AirDropBoxRangeOuter, float DeathBoxRange, float PickUpWrapperRange, float FindBuildingRange, bool InIsUseItemSpotLoc, int MaxTreasureChestNum, float TreasureChestRange, int MaxWeedNum, float WeedRange);
	void OnVehicleDamageInfo(class AController* InstigatorController, class AController* VictimController, int DamageTypeId, float Damage, bool bIsFatalHealthCost, class AActor* DamageCauser, class AActor* VictimVehicle);
	void OnFakePlayerRespawn();
	void OnAIStateRequestEnd();
	bool IsValid();
	bool IsAvailableBackpackItemType(const struct FItemDefineID& DefineID);
	bool HasPlayerAround();
	struct FVector GetViewForwardVector(class ACharacter* InCharacter);
	struct FAIStateInfo GetTeammatePlayerStateInfo(class ASTExtraBaseCharacter* InCharacter, TArray<struct FString> InWhiteList);
	TArray<struct FSoundState> GetSoundInfo();
	struct FProgressBarState GetProgressBarState();
	struct FAIPlayerInteractInfo GetPlayerInteractInfo();
	class ASTExtraBaseCharacter* GetOwnerBaseCharacter();
	TArray<struct FObstacleState> GetObstaclesState(class ASTExtraBaseCharacter* InPawn, float Range);
	uint32_t GetFrameNo();
	void GetDiffAIStateInfoToCacheGeneral();
	void GetDiffAIStateInfoToCache();
	struct FAIDamageSources GetDamageSources();
	struct FCameraState GetCameraState(class ASTExtraBaseCharacter* InCharacter);
	void GetAIStateInfoToCache();
	void GetAIStateInfoBaseModInternal();
	void GetAIPlayerBackpackItems(TArray<struct FAIBackpackItem>* Items);
	void GetAINearbyThrownState(class ASTExtraBaseCharacter* InCharacter, float InRange, float InCheckAngle, int MaxNum, float InSmokeRange, TArray<struct FAINearbyThrown>* Ret);
	void ClearVehicleDamageInfo();
	void ClearPlayerInteractInfo();
	void ClearDamageSources();
};


// Class AI.AIStateInfoComponentBRBase
// 0x0C70 (0x23C8 - 0x1758)
class UAIStateInfoComponentBRBase : public UAIStateInfoComponentBase
{
public:
	struct FAIStateInfoBRBase                          CacheAIStateInfoBRBase;                                   // 0x1758(0x02F8)
	struct FAIStateInfoBRBase                          LastAIStateInfoBRBase;                                    // 0x1A50(0x02F8)
	struct FDiffAIStateInfoBRBaseGeneral               CacheDiffAIStateInfoBRBaseGeneral;                        // 0x1D48(0x03F8)
	struct FDiffAIStateInfoBRBase                      CacheDiffAIStateInfoBRBase;                               // 0x2140(0x0288)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponentBRBase");
		return pStaticClass;
	}

};


// Class AI.AIStateInfoComponentMPBase
// 0x0148 (0x18A0 - 0x1758)
class UAIStateInfoComponentMPBase : public UAIStateInfoComponentBase
{
public:
	struct FAIStateInfoMPBase                          CacheAIStateInfoMPBase;                                   // 0x1758(0x0068)
	struct FAIStateInfoMPBase                          LastAIStateInfoMPBase;                                    // 0x17C0(0x0068)
	struct FDiffAIStateInfoMPBaseGeneral               CacheDiffAIStateInfoMPBaseGeneral;                        // 0x1828(0x0078)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponentMPBase");
		return pStaticClass;
	}

};


// Class AI.AIStateInfoComponentTeamDeath
// 0x00C0 (0x1960 - 0x18A0)
class UAIStateInfoComponentTeamDeath : public UAIStateInfoComponentMPBase
{
public:
	struct FAIStateInfoTeamDeath                       CacheAIStateInfoTeamDeath;                                // 0x18A0(0x0040)
	struct FAIStateInfoTeamDeath                       LastAIStateInfoTeamDeath;                                 // 0x18E0(0x0040)
	struct FDiffAIStateInfoTeamDeathGeneral            CacheDiffAIStateInfoTeamDeathGeneral;                     // 0x1920(0x0040)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoComponentTeamDeath");
		return pStaticClass;
	}

};


// Class AI.AIStateInfoDataAsset
// 0x01A0 (0x01D0 - 0x0030)
class UAIStateInfoDataAsset : public UDataAsset
{
public:
	TMap<int, int>                                     ProgressSkillConfig;                                      // 0x0030(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<int, bool>                                    AvailableBackpacItemTypes;                                // 0x0080(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	TMap<int, int>                                     GrenadeTypeConfig;                                        // 0x00D0(0x0050) (Edit, BlueprintVisible, ZeroConstructor)
	float                                              VisibleAngle;                                             // 0x0120(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FVector                                     HeadOffset;                                               // 0x0124(0x000C) (Edit, BlueprintVisible, IsPlainOldData)
	float                                              NearByEnemyRange;                                         // 0x0130(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	float                                              FogWeatherRangeScale;                                     // 0x0134(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	int                                                NearByEnemyMaxNum;                                        // 0x0138(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsSearchNearItem;                                         // 0x013C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x013D(0x0003) MISSED OFFSET
	int                                                NearbyItemMaxNum;                                         // 0x0140(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxBoxNum;                                          // 0x0144(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyAirDropBoxRangeInner;                               // 0x0148(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyAirDropBoxRangeOuter;                               // 0x014C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyDeathBoxRange;                                      // 0x0150(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyPickUpWrapperRange;                                 // 0x0154(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              CacheNearbyItemRangeCoefficient;                          // 0x0158(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxTreasureChestNum;                                // 0x015C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyTreasureChestRange;                                 // 0x0160(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMaxWeedNum;                                         // 0x0164(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyWeedRange;                                          // 0x0168(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyFindBuildingRange;                                  // 0x016C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ItemStateChangedRange;                                    // 0x0170(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsItemVisiable;                                           // 0x0174(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               IsUseItemSpotLoc;                                         // 0x0175(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0176(0x0002) MISSED OFFSET
	float                                              NearbyObstacleRange;                                      // 0x0178(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyThrownRange;                                        // 0x017C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbySmokeRange;                                         // 0x0180(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyThrownMaxNum;                                       // 0x0184(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x0188(0x0004) MISSED OFFSET
	int                                                NearbyDoorMaxNum;                                         // 0x018C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyVehicleRange;                                       // 0x0190(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData)
	int                                                NearbyVehicleMaxNum;                                      // 0x0194(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyBulletHoleRange;                                    // 0x0198(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyBulletHoleMaxNum;                                   // 0x019C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyDynamicItemsRange;                                  // 0x01A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyDynamicItemsMaxNum;                                 // 0x01A4(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              NearbyMonsterRange;                                       // 0x01A8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                NearbyMonsterMaxNum;                                      // 0x01AC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bIgnoreTreeAIWhenNoPlayerAround;                          // 0x01B0(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x01B1(0x0003) MISSED OFFSET
	float                                              IgnoreTreeAIRadius;                                       // 0x01B4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               UseBodyTPPCamera;                                         // 0x01B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x7];                                       // 0x01B9(0x0007) MISSED OFFSET
	TArray<int>                                        IgnoredMonsterIDs;                                        // 0x01C0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)

	static UClass* StaticClass()
	{
        static UClass *pStaticClass = 0;
        if (!pStaticClass)
            pStaticClass = UObject::FindClass("Class AI.AIStateInfoDataAsset");
		return pStaticClass;
	}

};


// Class AI.BTD_CheckObstacleInCustomRange
// 0x0080 (0x0108 - 0x0088)
class UBTD_CheckObstacleInCustomRange : public UBTDecorator_BlackboardBase
{
public:
	EObstacleDetectionSpace                            ObstacleDetectionType;                                    // 0x0088(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0089(0x0007) MISSED OFFSET
	struct FBlackboardKeySelector                      BBK_OriginLoc;                                            // 0x0090(0x0028) (Edit)
	unsigned char                                      bDrawDebug : 1;                                           // 0x00B8(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00B9(0x0003) MISSED OFFSET
	int                                                DrawSegments;                                             // 0x00BC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     SpaceSize;                                                // 0x00C0(0x000C) (Edit, IsPlainOldData)
	float                                              GravityScale;                                             // 0x00CC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              CustomMaxHeight;                                          // 0x00D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x00D4(0x0004) MISSED OFFSET
	struct FBlackboardKeySelector                      BBK_CapsuleSweepFinalLoc;                                 // 0x00D8(0x0028) (Edit)
